#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-etf9pXC5fwMmorqW

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.tara: Refreshing state... [id=38240725]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet_snapshot.original-main-snapshot: Refreshing state... [id=126133672]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_droplet.opl-docs: Refreshing state... [id=354030742]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_record.opl-docs: Refreshing state... [id=373168443]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_s3_bucket.remote_state: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_s3_bucket_versioning.remote_state: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_s3_bucket.remote_state: Drift detected (update)
aws_iam_policy.iac_deployer: Drift detected (update)
aws_iam_user_policy.personal: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.iac_deployer will be updated in-place
  ~ resource "aws_iam_policy" "iac_deployer" {
        id          = "arn:aws:iam::558855412466:policy/iac-deployer-policy"
        name        = "iac-deployer-policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (1 unchanged element hidden)
                            "s3:Get*",
                          - "iam:GetUser",
                          - "iam:GetPolicy",
                          - "iam:GetRole",
                          - "iam:GetPolicyVersion",
                          - "iam:ListAccessKeys",
                          - "iam:GetLoginProfile",
                          - "iam:ListRolePolicies",
                          - "iam:ListAttachedRolePolicies",
                          - "iam:GetUserPolicy",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_user_policy.personal will be updated in-place
  ~ resource "aws_iam_user_policy" "personal" {
        id     = "alex.jackson:alex.jackson.policy"
        name   = "alex.jackson.policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (3 unchanged elements hidden)
                            "iam:ChangePassword",
                          - "iam:GetUser",
                          - "iam:GetPolicy",
                          - "iam:GetRole",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "sts:AssumeRole"
                        Effect   = "Allow"
                        Resource = "arn:aws:iam::558855412466:role/iac-deployer"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # digitalocean_droplet.benchmarking will be created
  + resource "digitalocean_droplet" "benchmarking" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-22-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "benchmarking"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "lon1"
      + resize_disk          = true
      + size                 = "s-4vcpu-8gb"
      + ssh_keys             = [
          + "38210829",
        ]
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_record.benchmarking will be created
  + resource "digitalocean_record" "benchmarking" {
      + domain = "blackboards.pl"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "benchmarking"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

```

</details>